[{
        "recipe_name": "Falafel with Spicy Feta Sauce and Vegetable Salad",
        "preptime": 1800,
        "waittime": 30000,
        "cooktime": 900,
        "servings": 4,
        "comments": "",
        "calories": 2350,
        "fat": 141,
        "satfat": 50,
        "carbs": 184,
        "fiber": 47,
        "sugar": 48,
        "protein": 95,
        "instructions": "Rinse chickpeas and place in a large bowl. Cover with enough cold water to allow chickpeas to triple in volume. Cover and let stand at room temperature overnight.\r\n\r\nThe next day, rinse chickpeas and let drain thoroughly in a strainer while preparing remaining ingredients.\r\n\r\nCombine all falafel ingredients in the bowl of a food processor. Process until finely ground, about 30 seconds, stopping to scrape down the sides of the bowl as necessary.\r\n\r\nTransfer mixture to a medium bowl and cover. Refrigerate for 20 minutes before forming falafel. Prepare sauce while mixture is resting.\r\n\r\nScoop two heaping tablespoons per falafel and gently form into a slightly flattened ball. Place falafel on the airfry basket, being careful not to press down.\r\n\r\nSelect AIRFRY\/450°F\/SUPER CONVECTION\/15 minutes and press START to preheat oven.\r\nCook in rack position 4 until lightly browned and cooked through, about 15 minutes.\r\n\r\n--------\r\n\r\nMeanwhile, combine feta, garlic, oregano and pepper flakes in the bowl of a food processor. Process until feta is broken down and smooth, about 30 seconds. Scrape down the sides of the bowl.\r\n\r\nWith the machine running, add the olive oil through the feed tube and process until incorporated. Combine water and lemon juice in a small bowl. With the machine running, add the lemon juice mixture through the feed tube and process until a sauce forms. Set aside.\r\n\r\n-------\r\n\r\nIn a large bowl, whisk together olive oil and red wine vinegar. Season to taste with salt and black pepper. Add red onion, tomatoes, cucumber, and olives to bowl. Toss to combine.\r\n\r\nServe falafel immediately with salad, topping both with spicy feta sauce and serving remainder on the side of the plate.",
        "ingredients": [
            "8 oz dried chickpeas\r",
            "1\/2 oz fresh parsley\r",
            "1\/2 oz fresh cilantro\r",
            "6 green onions, sliced\r",
            "3 clove garlic, sliced\r",
            "1 tbsp kosher salt\r",
            "1 1\/2 tsp ground cumin\r",
            "3\/4 tsp ground coriander\r",
            "1\/4 tsp cayenne pepper\r",
            "<hr>\r",
            "8 oz feta cheese (block form)\r",
            "1 clove garlic, chopped\r",
            "1\/2 teaspoon dried oregano\r",
            "1\/2 teaspoon red pepper flakes\r",
            "1\/4 cup olive oil\r",
            "2 tablespoon water\r",
            "1 teaspoon lemon juice\r",
            "<hr>\r",
            "1\/2 cup red onion, thinly sliced\r",
            "1 cup cherry tomatoes, halved\r",
            "1 cup English cucumber, thinly sliced into half-moons\r",
            "2 oz kalamata olives, pitted and roughly chopped\r",
            "2 tbsp olive oil\r",
            "1 tbsp red wine vinegar"
        ],
        "tags": [
            "vegetarian",
            "main",
            "beans",
            "untried"
        ]
    },
    {
        "recipe_name": "Cavatelli and kale with fried rosemary and walnuts",
        "preptime": 1200,
        "waittime": 0,
        "cooktime": 900,
        "servings": 2,
        "comments": "",
        "calories": 1662,
        "fat": 100,
        "satfat": 36,
        "carbs": 162,
        "fiber": 18,
        "sugar": 12,
        "protein": 44,
        "instructions": "Heat a medium pot of salted water to boiling on high.\r\n\r\nFry the rosemary & walnuts: \r\nIn a large pan, heat a thin layer of oil on medium-high until hot. Once the oil is hot enough that a rosemary leaf sizzles immediately when added to the pan, add the rosemary and walnuts. Cook, stirring frequently, 2 to 3 minutes, or until the rosemary is crispy and the walnuts are golden brown. Leaving any oil in the pan, transfer the fried rosemary and walnuts to a paper towel-lined plate. Immediately season with salt and pepper.\r\n\r\nAdd the pasta to the pot of boiling water; cook according to package instructions or until al dente (still slightly firm to the bite). Reserving 1\/2 cup of the pasta cooking water, drain thoroughly.\r\n\r\nCook the kale:\r\nAdd 2 teaspoons of olive oil, the shallot, and the garlic to the pan; season with salt and pepper. Cook on medium-high, stirring occasionally, 2 to 3 minutes, or until softened and fragrant. Add the kale and as much of the red pepper flakes as you’d like, depending on how spicy you’d like the dish to be; season with salt and pepper. Cook, stirring frequently, 3 to 4 minutes, or until the kale has wilted. Add the vinegar (be careful, as the liquid may splatter) and cook, stirring constantly, 30 seconds to 1 minute, or until the liquid has cooked off. Add the heavy cream and cook, stirring constantly, 30 seconds to 1 minute, or until thoroughly combined. Turn off the heat and season with salt and pepper to taste.\r\n\r\nAdd the cooked pasta, butter, and half the reserved pasta cooking water to the pan of cooked kale. Cook on medium-high, stirring vigorously, 1 to 2 minutes, or until the pasta is thoroughly coated. (If the pasta seems dry, gradually add the remaining cooking water to achieve your desired consistency.) Turn off the heat and season with salt and pepper to taste. Divide the finished pasta between 2 dishes. Drizzle with olive oil. Top with the fried rosemary and walnuts. Garnish with the cheese. Enjoy!",
        "ingredients": [
            "1 bunch Rosemary, stems removed\r",
            "1\/4 cup Walnuts, roughly chopped\r",
            "<hr>",
            "6 oz dried cavatelli pasta\r",
            "2 tsp olive oil\r",
            "1 Shallot, peeled and thinly sliced\r",
            "2 clove Garlic, peeled and roughly chopped\r",
            "1 bunch Kale, washed, stems removed, roughly chopped\r",
            "1\/4 tsp Crushed Red Pepper Flakes\r",
            "2 Tbsp White wine vinegar\r",
            "1\/4 cup Heavy Cream\r",
            "<hr>",
            "2 Tbsp Butter\r",
            "1\/2 cup reserved pasta cooking water\r",
            "2 Tbsp Parmesan, grated"
        ],
        "tags": [
            "vegetarian",
            "main",
            "pasta"
        ]
    },
    {
        "recipe_name": "Baked macaroni and cheese",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 6,
        "comments": "",
        "calories": 3648,
        "fat": 216,
        "satfat": 132,
        "carbs": 282,
        "fiber": 12,
        "sugar": 54,
        "protein": 156,
        "instructions": "Heat the oven to 350 degrees F.\r\n\r\nPlace dry pasta in a 4-quart pot and barely cover with cold water. Bring just to a boil over high heat, stirring occasionally, then test for doneness. You’re looking for al dente, that is the noodles should put up some resistance to the tooth but not so much that it gums up in your back teeth. Drain pasta in a colander but do not rinse.\r\n\r\nMeanwhile, melt the butter in a 3-quart saucier or saucepan over medium heat. Whisk in the flour and cook until the mixture is pale blond, stirring occasionally, about 3 minutes. Whisk in the mustard, paprika and onion and cook another minute. Whisk in the milk and cook over medium-high heat, whisking often for 7 to 8 minutes, or until slightly thickened. Remove from the heat.\r\n\r\nLightly beat the egg in a small bowl then drizzle in about half a cup of the milk mixture, whisking constantly. Then, whisk the egg mixture into to the milk mixture. (This common maneuver called “tempering” prevents curdling of the egg by slowly increasing their temperature. Skip this and you’ll be making scrambled eggs.) Stir in the cheese, 1 teaspoon salt and the pepper. Fold in the macaroni then move to a 4-quart casserole or soufflé dish.\r\n\r\nSprinkle with the remaining cheese, then toss the breadcrumbs with the melted butter and distribute evenly over the top. Bake for 30 minutes, cool for 5 minutes, then serve to a grateful world.",
        "ingredients": [
            "8 ounce elbow macaroni\r",
            "3 tablespoon unsalted butter\r",
            "3 tablespoon all-purpose flour\r",
            "1 tablespoon ground mustard\r",
            "1 teaspoon smoked paprika\r",
            "1\/2 cup onion, diced small\r",
            "3 cup whole milk\r",
            "1 large egg\r",
            "9 ounce sharp cheddar cheese, grated\r",
            "1 teaspoon kosher salt\r",
            "1\/2 teaspoon black pepper, freshly ground\r",
            "<hr>\r",
            "3 ounce sharp cheddar cheese, grated\r",
            "3 tablespoon unsalted butter, melted\r",
            "1 cup panko breadcrumbs"
        ],
        "tags": [
            "vegetarian",
            "main",
            "pasta"
        ]
    },
    {
        "recipe_name": "Creamy chipotle salad dressing",
        "preptime": 600,
        "waittime": 0,
        "cooktime": 0,
        "servings": 4,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "",
        "ingredients": [
            "1\/2 cup Greek yogurt (or creme fraiche) \r",
            "2 tablespoon lime juice\r",
            "2 teaspoon chipotle in adobo\r",
            "1\/2 teaspoon Mexican seasoning\r",
            "1\/4 teaspoon salt\r",
            "1 tablespoon olive oil\r",
            "1\/4 cup cilantro"
        ],
        "tags": [
            "components"
        ]
    },
    {
        "recipe_name": "Vadouvan curry spice blend",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 2,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Preheat oven to 350°F with rack in middle.\r\n\r\nPulse onions in 3 batches in a food processor until very coarsely chopped (there may be a few large pieces remaining), transferring to a bowl. Repeat with shallots, then garlic.\r\n\r\nHeat oil in a deep 12-inch heavy nonstick skillet over high heat until it shimmers, then sauté onions, shallots, and garlic (stir often) until golden and browned in spots, 25 to 30 minutes\r\n\r\nGrind fenugreek seeds in grinder or with mortar and pestle. Add to onion mixture along with remaining ingredients, and stir until combined.\r\n\r\nTransfer to a parchment-paper-lined large 4-sided sheet pan and spread as thinly and evenly as possible. Bake, stirring occasionally with a skewer to separate onions, until well browned and barely moist, 1 to 1 1\/4 hours.",
        "ingredients": [
            "2 pound onions, cut into 1-inch pieces\r",
            "1 pound shallots, halved\r",
            "12 garlic cloves, peeled\r",
            "1\/4 cup vegetable oil\r",
            "1 teaspoon fenugreek seeds\r",
            "1 tablespoon thinly sliced fresh curry leaves (optional)\r",
            "1 tablespoon ground cumin\r",
            "1 teaspoon ground cardamom\r",
            "1 teaspoon brown mustard seeds\r",
            "3\/4 teaspoon turmeric\r",
            "1\/2 teaspoon grated nutmeg\r",
            "1\/2 teaspoon hot red-pepper flakes\r",
            "1\/4 teaspoon ground cloves\r",
            "1 tablespoon salt\r",
            "1 teaspoon black pepper"
        ],
        "tags": [
            "components"
        ]
    },
    {
        "recipe_name": "Roasted Sweet Potato Quesadillas",
        "preptime": 600,
        "waittime": 0,
        "cooktime": 1800,
        "servings": 2,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Preheat oven to 450°F. Prepare a baking sheet with foil. Place **sweet potato** slices in a single layer, then drizzle with olive oil, salt, pepper, and **mexican spice**. Roast 18-20 minutes, until brown and tender.\r\n\r\nIn a small pot, combine **shallot**, **sugar**, ¾ of the **lime juice**, ¼ cup of water, and salt and pepper. Heat to boiling on high; once boiling, cook 1-2 minutes, stirring occasionally, until the sugar has dissolved. Set aside to cool for at least 10 minutes.\r\n\r\nPrepare the avocado: slice it, then place in a bowl. Squeeze remaining ¼ of lime juice over it, season with salt and pepper, and lightly toss. Set aside to season.\r\n\r\nWhen the sweet potato is done roasting, prepare the quesadillas. Top one half of each **tortilla** with half the **cheddar**, the **sweet potatoes**, the **piquante peppers**, and the **jalapeño**, finishing with the remaining cheddar. Fold in half.\r\n\r\nIn a large pan, heat 2 tsp of oil on medium. Cook the quesadillas 2-3 minutes per side, until lightly browned and the cheese is melted.\r\n\r\nTo prepare the salad, put the salad greens in a salad bowl, and top with the pickled shallots and half the pickling liquid. (The rest is unused.) Drizzle with olive oil, salt, and pepper, and toss to combine. Top with avocado when serving.\r\n\r\nGarnish quesadillas and salad with **cotija**.",
        "ingredients": [
            "1 sweet potato, sliced into ¼\" rounds\r",
            "1\/2 tbsp mexican spice\r",
            "<hr>\r",
            "3 cup salad greens\r",
            "1 avocado, sliced\r",
            "1 shallot, thinly sliced\r",
            "1 tbsp sugar\r",
            "1 lime, divided and juiced\r",
            "<hr>\r",
            "4 oz white cheddar cheese, grated\r",
            "1 jalapeño (preferably pickled), roughly chopped\r",
            "1\/4 cotija cheese, grated\r",
            "2 oz sweet piquante peppers, rough chopped\r",
            "4 flour tortillas"
        ],
        "tags": [
            "quesadilla",
            "vegetarian",
            "main"
        ]
    },
    {
        "recipe_name": "Vietnamese-Style Vegetable Sandwiches with Spicy Mayo and Roasted Broccoli",
        "preptime": 600,
        "waittime": 1800,
        "cooktime": 0,
        "servings": 2,
        "comments": "Pair with a zesty, tropical white wine",
        "calories": 1540,
        "fat": 82,
        "satfat": 8,
        "carbs": 174,
        "fiber": 16,
        "sugar": 36,
        "protein": 36,
        "instructions": "Place an oven rack in the center of the oven, then preheat to 450°F. Line a sheet pan with aluminum foil. Place **broccoli** on the sheet pan. Drizzle with olive oil and season with salt and pepper; toss to coat. Arrange in an even layer. Roast 19 to 21 minutes, or until lightly browned and tender when pierced with a fork. Leaving the oven on, transfer the roasted broccoli to a bowl. Reserving the sheet pan, remove and discard the foil.\r\n\r\nTo make the spicy mayonnaise, in a bowl, combine the **mayonnaise** and as much of the **sambal oelek** as you’d like, depending on how spicy you’d like the dish to be. Season with salt and pepper to taste. In a medium bowl, combine the sliced **radishes**, **grated carrots**, **sugar**, and **vinegar**; season with salt and pepper. Set aside to marinate, stirring occasionally, for at least 10 minutes. Season with salt and pepper to taste.\r\n\r\nWhile the vegetables marinate, in a medium pan (nonstick, if you have one), heat 2 tablespoons of olive oil on medium-high until hot. Add the quartered **mushrooms** in an even layer. Cook, without stirring, 2 to 3 minutes, or until lightly browned and slightly softened; season with salt and pepper. Continue to cook, stirring occasionally, 2 to 3 minutes, or until softened. Add the chopped **ginger**; season with salt and pepper. Cook, stirring frequently, 1 to 2 minutes, or until softened. Turn off the heat and season with salt and pepper to taste.\r\n\r\nPlace the halved **baguettes** cut side up on the sheet pan used to roast the broccoli. Drizzle with olive oil and season with salt and pepper. Toast in the oven 5 to 7 minutes, or until the edges are lightly browned. Carefully transfer to a work surface.\r\n\r\nWhile the baguettes toast, reserving the liquid, drain the marinated vegetables. Set aside. Add the reserved marinating liquid and **sesame seeds** to the bowl of roasted broccoli; stir to coat. Season with salt and pepper to taste.\r\n\r\nBuild the sandwiches using the toasted baguettes, spicy mayonnaise, cooked mushrooms, and marinated vegetables. Serve the sandwiches with the dressed broccoli. Enjoy!",
        "ingredients": [
            "1\/2 lb Broccoli, cut into small florets\r",
            "1\/2 lb Cremini Mushrooms, quartered\r",
            "1 1-Inch Piece Ginger, peeled and finely chopped\r",
            "<hr>",
            "1\/4 cup Mayonnaise\r",
            "1 Tbsp Sambal Oelek\r",
            "<hr>",
            "3 oz Radishes, thinly sliced into half-moons\r",
            "6 oz Carrots, grated\r",
            "1 Tbsp Sugar\r",
            "2 Tbsp Rice Vinegar\r",
            "<hr>",
            "2 Small Baguettes, halved\r",
            "1\/2 tsp Black sesame seeds\r",
            "1\/2 tsp White Sesame Seeds\r",
            "Olive oil\r",
            "Salt\r",
            "Black pepper"
        ],
        "tags": [
            "vegetarian",
            "main",
            "sandwiches"
        ]
    },
    {
        "name": "Mexican spice blend",
        "preptime": 300,
        "waittime": 0,
        "cooktime": 0,
        "servings": 5,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Mix all ingredients",
        "ingredients": [
            "1 tbsp Ancho chile powder\r",
            "1 tbsp Smoked paprika\r",
            "1 tbsp garlic powder\r",
            "1 tbsp ground cumin\r",
            "1 tbsp dried Mexican oregano"
        ],
        "tags": [
            "components"
        ]
    },
    {
        "recipe_name": "Black bean and zucchini enchiladas",
        "preptime": 2100,
        "waittime": 0,
        "cooktime": 600,
        "servings": 2,
        "comments": "Pair with a fruity rose wine",
        "calories": 1620,
        "fat": 54,
        "satfat": 24,
        "carbs": 228,
        "fiber": 20,
        "sugar": 20,
        "protein": 64,
        "instructions": "Preheat the oven to 450°F. In a small pot, combine the **rice**, a big pinch of salt, the **spice blend**, and **water**. Heat to boiling on high. Once boiling, reduce the heat to low. Cover and cook, without stirring, 12 to 14 minutes, or until the water has been absorbed and the rice is tender. Turn off the heat and fluff with a fork. Transfer to a large bowl.\r\n\r\nWhile the rice continues to cook, in a large pan (nonstick, if you have one), heat **olive oil** on medium-high until hot. Add the diced **zucchini** in an even layer. Cook, without stirring, 3 to 4 minutes, or until lightly browned. Season with salt and pepper. Continue to cook, stirring frequently, 2 to 3 minutes, or until softened. Transfer to the bowl of cooked rice. Add the **beans**, **vinegar**, and a drizzle of olive oil. Season with salt and pepper and stir to combine. Wipe out the pan.\r\n\r\nIn the same pan, heat a drizzle of olive oil on medium-high until hot. Add the sliced **white bottoms of the scallions**; season with salt and pepper. Cook, stirring frequently, 30 seconds to 1 minute, or until slightly softened. Add the **tomato paste** and **chile paste**. Cook, stirring frequently, 1 to 2 minutes, or until thoroughly combined. Add **water** (carefully, as the liquid may splatter). Cook, stirring constantly, 30 seconds to 1 minute, or until slightly thickened. Turn off the heat. Stir in the **sour cream or crema** and season with salt and pepper to taste.\r\n\r\nSpread about 2 cups of the filling into the bottom of a baking dish. Place the **tortillas** on a work surface. Divide the remaining filling among the tortillas; tightly roll up each tortilla around the filling. Transfer to the baking dish in an even layer, seam side down. Evenly top with the sauce and **grated cheese**. Season with salt and pepper.\r\n\r\nBake the enchiladas 7 to 9 minutes, or until lightly browned and the cheese is melted. Remove from the oven. Let stand at least 2 minutes before serving. Garnish the baked enchiladas with the sliced **green tops of the scallions**. Enjoy! \r\n",
        "ingredients": [
            "1\/2 cup Jasmine Rice\r",
            "1\/2 serving [Mexican spice blend](https:\/\/www.xanthir.com\/recipes\/showrecipe.php?id=id519)",
            "1 cup water\r",
            "<hr>\r",
            "2 tsp olive oil\r",
            "1 Zucchini, medium diced\r",
            "1 15-Ounce Can Black Beans, drained and rinsed\r",
            "1 Tbsp White Wine Vinegar\r",
            "2 Scallions, thinly slice, white and green parts separated\r",
            "2 Tbsp Tomato Paste\r",
            "2 Tbsp Ancho Chile Paste\r",
            "1\/2 cup water\r",
            "1\/4 cup Sour Cream Or Mexican Crema\r",
            "<hr>\r",
            "4 small flour tortillas\r",
            "2 oz White Cheddar Cheese, grated"
        ],
        "tags": [
            "vegetarian",
            "main"
        ]
    },
    {
        "recipe_name": "Peach & Pickled Pepper Grilled Cheese",
        "preptime": 900,
        "waittime": 0,
        "cooktime": 600,
        "servings": 2,
        "comments": "Pairs with crisp & minerally rosé",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Assemble sandwiches with **bread**, **cheese**, **peach**, and **peppers**. Season with salt and pepper. Melt **butter** over medium heat, and cook sandwiches 2-4 minutes per side until golden brown. When finished, rub with **garlic clove** and season if desired.\r\n\r\nWhile the sandwiches cook, whisk together the **mustard**, **mayo**, **vinegar**, **olive oil**, and a pinch of **salt and pepper**. Toss the **lettuce**, **radish**, and **goat cheese** with the dressing. Serve.",
        "ingredients": [
            "4 slices sandwich bread\r",
            "1\/2 oz sweet piquante peppers, roughly chopped\r",
            "1 peach, pitted and thinly sliced\r",
            "2 oz fontina cheese, thinly sliced\r",
            "2 oz white cheddar cheese, thinly sliced\r",
            "1 tbsp butter\r",
            "1 clove garlic\r",
            "<hr>\r",
            "3 cup salad greens, washed and torn\r",
            "3 oz radishes, halved and thinly sliced\r",
            "1\/2 tbsp dijon mustard\r",
            "1\/2 tbsp mayonnaise\r",
            "1 tsp olive oil\r",
            "1 tbsp apple cider vinegar\r",
            "salt and pepper\r",
            "1 oz goat cheese"
        ],
        "tags": [
            "vegetarian",
            "main",
            "sandwich"
        ]
    },
    {
        "recipe_name": "Whipped eggs on toast",
        "preptime": 300,
        "waittime": 0,
        "cooktime": 600,
        "servings": 2,
        "comments": "",
        "calories": 436,
        "fat": 28,
        "satfat": 6,
        "carbs": 28,
        "fiber": 2,
        "sugar": 4,
        "protein": 16,
        "instructions": "Preheat oven to 325F.\r\nline a baking sheet with baking paper.\r\nCarefully seperate eggs, keeping yolks whole.\r\nUsing a mixer, beat whites with a pinch of salt into soft peaks.\r\nSpoon into puffy mounds on centre of toasts; shape a hollow in the top.\r\nSlip a yolk into each hollow.\r\nBake for 5 minutes.\r\nSpoon 1 tablespoon of dressing over yolks.\r\nBake 5 minutes more, or until whites are beginning to turn golden and yolks set to your liking.\r\nSprinkle with the chives and serve.",
        "ingredients": [
            "2 eggs\r",
            "2 slices bread, toasted, thick, rustic style\r",
            "2 tablespoon Dijonnaise mustard\r",
            "1\/2 tablespoon fresh chives, finely chopped"
        ],
        "tags": [
            "breakfast",
            "eggs",
            "untried"
        ]
    },
    {
        "recipe_name": "Cozy bean and egg skillet for two",
        "preptime": 300,
        "waittime": 0,
        "cooktime": 420,
        "servings": 2,
        "comments": "",
        "calories": 714,
        "fat": 28,
        "satfat": 4,
        "carbs": 92,
        "fiber": 22,
        "sugar": 2,
        "protein": 36,
        "instructions": "Heat the oil in a small skillet over medium-high heat. Add the garlic and thyme and cook until the garlic is fragrant, about 45 seconds. Stir in the beans, water, and pepper (if the beans are unsalted, add a little salt, too). Turn the heat up to high and cook, stirring here and there and smashing the beans with your spatula, until the beans are saucy and the liquid is creamy, 2 to 4 minutes.\r\n\r\nUsing your spatula, make wells in the beans, one for each egg. Crack the eggs into the wells one at a time, then cover and cook until the whites are set but the yolks still jiggle when you shake the pan a bit, 1 to 2 minutes.\r\n\r\nTaste, garnish with thyme leaves and season with a little more salt and pepper. Eat right away with toasted and oiled bread, if you want.",
        "ingredients": [
            "1 tbsp olive oil\r",
            "1 clove garlic, pressed\r",
            "1 tsp fresh thyme, plus more for garnish\r",
            "1\/2 can canned cannellini beans, rinsed\r",
            "1\/2 cup water\r",
            "1\/4 tsp Kosher salt\r",
            "1\/4 tsp Freshly ground black pepper\r",
            "2 eggs\r",
            "2 slices toast"
        ],
        "tags": [
            "breakfast",
            "vegetarian"
        ]
    },
    {
        "recipe_name": "Fresh salmon mini burgers",
        "preptime": 900,
        "waittime": 0,
        "cooktime": 480,
        "servings": 6,
        "comments": "",
        "calories": 192,
        "fat": 11,
        "satfat": 4,
        "carbs": 4,
        "fiber": 0,
        "sugar": 1,
        "protein": 18,
        "instructions": "Mix all ingredients except butter and oil very well with your hands until everything sticks together. Form into mini burger patties. Fry on both sides in a mixture of butter and vegetable oil over medium heat until just cooked through.",
        "ingredients": [
            "1 lb salmon filet, boneless\/skinless, chopped up in food processor\r",
            "1\/3 cup dried bread crumbs\r",
            "2 tbsp whole milk\r",
            "3 tbsp green onion, finely chopped\r",
            "1 egg\r",
            "2 tbsp fresh dill, chopped\r",
            "2 tbsp cream cheese\r",
            "<hr>",
            "1 tbsp butter\r",
            "1 tbsp vegetable oil"
        ],
        "tags": [
            "vegetarian",
            "bento",
            "main",
            "untried"
        ]
    },
    {
        "recipe_name": "Black bean mini burgers",
        "preptime": 900,
        "waittime": 0,
        "cooktime": 480,
        "servings": 6,
        "comments": "",
        "calories": 702,
        "fat": 18,
        "satfat": 0,
        "carbs": 120,
        "fiber": 30,
        "sugar": 18,
        "protein": 30,
        "instructions": "Mix all the ingredient, except the oil,very well with your hands to a paste-like consistency and form into mini-burgers, pressing each one together firmly. Pan-fry in oil over low heat, turning gently so they don't fall apart. Pack some salsa as a dip.",
        "ingredients": [
            "1 15oz can black beans, drained and chopped up finely in food processor\r",
            "1\/3 cup bread crumbs\r",
            "1 medium onion, finely chopped and sauteed until translucent\r",
            "2 tbsp cilantro, finely chopped\r",
            "1\/2 tsp ground cumin\r",
            "1 tsp flour\r",
            "1\/2 tsp ground allspice\r",
            "<hr>\r",
            "1 tbsp vegetable oil\r",
            "salsa, for dipping"
        ],
        "tags": [
            "vegetarian",
            "bento"
        ]
    },
    {
        "recipe_name": "Pesto Cavatelli w\/ Mushrooms and Spicy Breadcrumbs",
        "preptime": 300,
        "waittime": 0,
        "cooktime": 1800,
        "servings": 2,
        "comments": "",
        "calories": 1740,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Heat a medium pot of salted water to boiling on high.\r\n\r\nIn a medium pan, heat 2 teaspoons of olive oil on medium-high until hot. Add the **breadcrumbs** and half the **chopped garlic**; season with salt and pepper. Cook, stirring frequently, 2 to 3 minutes, or until golden brown. Turn off the heat and add the red pepper flakes, salt, and pepper. Transfer to a plate. Wipe out the pan. \r\n\r\nWhile the breadcrumbs toast, add the **pasta** to the pot of boiling water. Cook, stirring occasionally, 9 to 11 minutes, or until al dente (still slightly firm to the bite). Turn off the heat. Reserving ½ cup of the pasta cooking water, drain thoroughly and return to the pot. \r\n\r\nWhile the pasta cooks, in the same pan, heat 2 teaspoons of olive oil on medium-high until hot. Add the **sliced mushrooms** in an even layer and cook, without stirring, 3 to 4 minutes, or until lightly browned. Continue to cook, stirring occasionally, 1 to 2 minutes, or until browned. Add the **sliced zucchini** and remaining **chopped garlic**; season with salt and pepper. Cook, stirring frequently, 4 to 5 minutes, or until lightly browned. Turn off the heat and season with salt and pepper to taste. \r\n\r\nTo the pot of **cooked pasta**, add the **cooked vegetables**, **mascarpone cheese**, and half the reserved pasta cooking water. Cook on medium-high, stirring vigorously, 1 to 2 minutes, or until coated. If the pasta seems dry, gradually add the remaining pasta cooking water to achieve your desired consistency. Turn off the heat. Stir in the **pesto** and **chopped peppers** until thoroughly combined. Season with salt and pepper to taste. Serve the finished pasta garnished with the spicy breadcrumbs.",
        "ingredients": [
            "10 oz cavatelli pasta\r",
            "2 clove garlic, finely chopped\r",
            "4 oz cremini Mushrooms, thinly sliced\r",
            "1\/3 cup Basil & Cashew Pesto\r",
            "1\/4 tsp Crushed Red Pepper Flakes\r",
            "1\/4 cup Panko\r",
            "1 Tbsp  mascarpone cheese\r",
            "1 oz Roasted Piquillo Peppers, diced\r",
            "1 Zucchini, halved and thinly sliced"
        ],
        "tags": [
            "vegetarian",
            "pasta",
            "main"
        ]
    },
    {
        "recipe_name": "Flaxseed muffin in a minute",
        "preptime": 180,
        "waittime": 0,
        "cooktime": 60,
        "servings": 1,
        "comments": "",
        "calories": 344,
        "fat": 21,
        "satfat": 1,
        "carbs": 37,
        "fiber": 24,
        "sugar": 4,
        "protein": 12,
        "instructions": "Mix the flax meal, baking powder, sugar and cinnamon in a coffee mug or single-serving soufflé dish.\r\n\r\nAdd the egg and butter (or oil). Mix with dry ingredients.\r\n\r\nMicrowave 1 minute or more, until firm\r\n\r\nTurn out and serve with butter or cream cheese. Or toast before applying spread. Makes 1 serving.",
        "ingredients": [
            "4 tbsp ground flaxseed\r",
            "1\/2 tsp Baking Powder\r",
            "1 tsp granulated sugar\r",
            "1 tsp Cinnamon\r",
            "1 large Egg\r",
            "1 tsp olive oil, or butter"
        ],
        "tags": [
            "breakfast",
            "quick",
            "untried"
        ]
    },
    {
        "recipe_name": "Almond muffin in a minute",
        "preptime": 180,
        "waittime": 0,
        "cooktime": 60,
        "servings": 1,
        "comments": "",
        "calories": 327,
        "fat": 23,
        "satfat": 3,
        "carbs": 23,
        "fiber": 11,
        "sugar": 5,
        "protein": 12,
        "instructions": "Place all dry ingredients in a coffee mug. Stir to combine.\r\n\r\nAdd the vanilla, egg, and oil. Stir until thoroughly combined.\r\n\r\nMicrowave for 1 minute. Use a knife if necessary to help remove the muffin from the cup, slice, butter, eat.",
        "ingredients": [
            "1\/4 cup almond meal\/flour\r",
            "1 tsp granulated sugar\r",
            "1\/4 tsp baking powder\r",
            "1 dash salt\r",
            "1\/2 tsp vanilla extract\r",
            "1 large egg\r",
            "1 tsp olive oil"
        ],
        "tags": [
            "breakfast",
            "quick"
        ]
    },
    {
        "recipe_name": "Cheesy mushroom omelette",
        "preptime": 300,
        "waittime": 0,
        "cooktime": 600,
        "servings": 1,
        "comments": "",
        "calories": 332,
        "fat": 26,
        "satfat": 10,
        "carbs": 4,
        "fiber": 1,
        "sugar": 2,
        "protein": 21,
        "instructions": "Heat the olive oil in a small non-stick frying pan. Tip in the mushrooms and fry over a high heat, stirring occasionally for 2-3 mins until golden. Lift out of the pan into a bowl and mix with the cheese and parsley.\r\n\r\nPlace the pan back on the heat and swirl the eggs into it. Cook for 1 min or until set to your liking, swirling with a fork now and again.\r\n\r\nSpoon the mushroom mix over one half of the omelette. Using a spatula or palette knife, flip the omelette over to cover the mushrooms. Cook for a few moments more, lift onto a plate and serve.",
        "ingredients": [
            "1\/2 tbsp olive oil\r",
            "3 cremini mushrooms (3 ≈ 2oz), sliced\r",
            "1 oz cheddar cheese, grated\r",
            "1 tbsp fresh parsley, chopped\r",
            "2 eggs, beaten"
        ],
        "tags": [
            "vegetarian",
            "breakfast"
        ]
    },
    {
        "recipe_name": "Mexican egg roll up",
        "preptime": 300,
        "waittime": 0,
        "cooktime": 600,
        "servings": 1,
        "comments": "",
        "calories": 243,
        "fat": 19,
        "satfat": 4,
        "carbs": 5,
        "fiber": 2,
        "sugar": 2,
        "protein": 13,
        "instructions": "For each egg: Beat 1 egg with 1 tbsp water. Heat 1 tsp oil in a medium non-stick pan. Add the egg and swirl round the base of the pan, as though you are making a pancake, and cook until set. There is no need to turn it.\r\n\r\nCarefully tip the pancake onto a board, spread the salsa, sprinkle coriander, then roll it up. It can be eaten warm or cold – you can keep it for 2 days in the fridge.",
        "ingredients": [
            "2 large eggs\r",
            "1\/4 cup fresh salsa\r",
            "2 tbsp fresh cilantro, chopped\r",
            "2 tsp olive oil"
        ],
        "tags": [
            "vegetarian",
            "breakfast",
            "quick",
            "make_ahead"
        ]
    },
    {
        "recipe_name": "Oregano halloumi with orzo salad",
        "preptime": 600,
        "waittime": 0,
        "cooktime": 480,
        "servings": 4,
        "comments": "",
        "calories": 2352,
        "fat": 160,
        "satfat": 56,
        "carbs": 112,
        "fiber": 16,
        "sugar": 16,
        "protein": 112,
        "instructions": "Bring a large pan of salted water to the boil and cook the orzo following pack instructions. Meanwhile, mix the chopped oregano in a small bowl with the oil and brush some over the halloumi. Heat a large, non-stick frying pan and cook the halloumi for a few mins each side until golden and soft.\r\n\r\nDrain the cooked orzo and mix with the tomatoes, olives and pesto. Season to taste. Spoon onto a serving plate and top with the halloumi. Drizzle over any remaining oregano oil and scatter over the leaves.",
        "ingredients": [
            "12 oz dried orzo\r",
            "1\/2 oz fresh oregano, leaves picked, large ones roughly chopped\r",
            "3 tbsp olive oil\r",
            "9 oz halloumi, sliced\r",
            "7 oz cherry tomatoes, halved\r",
            "1\/4 cup pitted black olives, chopped\r",
            "5 oz pesto"
        ],
        "tags": [
            "vegetarian",
            "main"
        ]
    },
    {
        "recipe_name": "Super veggie onigirazu",
        "preptime": 1200,
        "waittime": 0,
        "cooktime": 0,
        "servings": 1,
        "comments": "",
        "calories": 338,
        "fat": 12,
        "satfat": 2,
        "carbs": 53,
        "fiber": 9,
        "sugar": 10,
        "protein": 8,
        "instructions": "1. Place a square piece of plastic wrap on your work surface and then place the sheet of nori (shiny side down) with a corner pointing up, on top of the plastic wrap.\r\n\r\n2. Form a thin layer of rice into the shape of a square in the center of the nori sheet, with the flat sides facing up\/down and side-to-side (see video). It helps to wet your fingers when your shaping the rice.\r\n\r\n3. Spread the mayo and mustard on top of the rice and sprinkle with salt and pepper. Then pile on the veggies. Spoon some more rice on top of the veggies and form into another square. Tightly, but gently fold up the corners of the nori so that it completely covers the rice. Then fold up two corners of the plastic wrap to cover the nori and hold it in place. Place a piece of julienned carrot perpendicular to the way the ingredients run on top so that you know which direction to slice the onigirazu. Then fold up the last two sides of plastic wrap and set aside for at least 5 minutes and up to overnight.\r\n\r\n4. When ready to serve, slice the onigirazu along the length of the carrot you placed on the outside, remove the plastic wrap and enjoy.",
        "ingredients": [
            "1 sheet of nori\r",
            "3\/4 cup cooked sushi rice\r",
            "mayonnaise, to taste\r",
            "Dijon mustard, to taste\r",
            "2 small leaves of romaine lettuce\r",
            "1\/2 small carrot, peeled and julienned\r",
            "1\/8 English cucumber, thinly sliced\r",
            "1\/8 cup red onion, thinly sliced and halved\r",
            "1\/4 large avocado, sliced\r",
            "1\/8 small red cabbage, thinly sliced\r",
            "1 slice large tomato\r",
            "Kosher salt and freshly ground black pepper, to taste"
        ],
        "tags": [
            "vegetarian",
            "main"
        ]
    },
    {
        "recipe_name": "Sweet and Spicy Tofu with Jasmine Rice and Crispy Shallot",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 2,
        "comments": "",
        "calories": 1560,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Remove the honey from the refrigerator to bring to room temperature. \r\n\r\nCook the **rice**: In a small saucepan, combine the rice, a big pinch of salt, and 1 cup of water. Heat to boiling on high. Once boiling, cover and reduce the heat to low. Cook 12 to 14 minutes, or until the water has been absorbed and the rice is tender. Turn off the heat and fluff the cooked rice with a fork.\r\n\r\nMix **shallot**, **rice flour**, salt, and pepper in a bowl. Toss to thoroughly coat. In a large pan, heat a thin layer of oil on medium-high until hot. Once the oil is hot enough that a piece of shallot sizzles immediately when added to the pan, add the coated shallot in a single layer (tapping off any excess flour before adding). Cook, stirring frequently, 2 to 3 minutes, or until browned and crispy. Transfer to a paper towel-lined plate; immediately season with salt and pepper. Rinse and wipe out the pan.\r\n\r\nIn the same pan, heat 2 teaspoons of olive oil on medium-high until hot. Add the **zucchini** and **sweet peppers**. Cook, stirring occasionally, 3 to 4 minutes, or until lightly browned. Turn off the heat; stir in the green tops of the **scallions**. Season with salt and pepper to taste. Transfer to a bowl; set aside in a warm place. Wipe out the pan.\r\n\r\nIn the same pan, heat 2 teaspoons of olive oil on medium-high until hot. Add the **tofu**; season with salt and pepper. Cook, frequently breaking the tofu apart with a spoon, 3 to 4 minutes, or until browned. Add the **garlic**, white bottoms of the **scallions**, **honey**, **soy sauce**, the juice of half the **lime**, 2 tablespoons of water, and as much of the **chili pepper** as you’d like, depending on how spicy you’d like the dish to be. Cook, stirring frequently, 1 to 2 minutes, or until thoroughly combined and the tofu is warmed through.\r\n\r\nDish up the rice, top with tofu and vegetables. Garnish with the fried shallot, cilantro and mint. Top with juice of remaining lime wedges.",
        "ingredients": [
            "1\/2 cup Jasmine rice\r",
            "<hr>\r",
            "1 shallot, peeled and thinly sliced\r",
            "2 tbsp rice flour\r",
            "<hr>\r",
            "4 oz sweet peppers, halved lengthwise, seeds\/ribs removed, thinly sliced crosswise\r",
            "1 zucchini, large diced\r",
            "2 green onions, thinly sliced, whites and greens separated\r",
            "<hr>\r",
            "7 oz tofu\r",
            "2 clove garlic, roughly chopped\r",
            "1 lime, halved\r",
            "1\/2 tbsp fresh cilantro, chopped\r",
            "1\/2 tbsp fresh mint, chopped\r",
            "2 tsp golden mountain sauce\r",
            "1 Thai chili (or jalapeno), thinly sliced into rounds\r",
            "1 tbsp honey, warmed to room temperature"
        ],
        "tags": [
            "main",
            "vegetarian",
            "asian"
        ]
    },
    {
        "recipe_name": "Bacon cheddar chive scones",
        "preptime": 1200,
        "waittime": 0,
        "cooktime": 1320,
        "servings": 8,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Preheat the oven to 425°F. Lightly grease a baking sheet, or line it with parchment.\r\n\r\nWhisk together the flour, salt, baking powder, and sugar. Work the butter into the flour until the mixture is unevenly crumbly, with some of the butter remaining in larger pieces.\r\n\r\nMix in the cheese, chives, and bacon until evenly distributed.\r\n\r\nAdd ¾ cup of the cream, stirring to combine. Try squeezing the dough together; if it's crumbly and won't hang together, or if there are crumbs remaining in the bottom of the bowl, add cream until the dough comes together. Transfer the shaggy dough to a well-floured work surface.\r\n\r\nPat the dough into a smooth 7\" disk about 3\/4\" thick. Transfer the disk to the prepared baking sheet. Use a knife or bench knife to cut the disk into 8 wedges, spreading the wedges apart a bit on the pan.\r\nBrush the scones with a bit of cream; this will help their crust brown.\r\n\r\nBake the scones for 22 to 24 minutes, until they're golden brown. Remove them from the oven, and cool right on the pan. Serve warm, or at room temperature.\r\n\r\nTips:\r\nWant to make scones now, freeze and bake later? Make scones up to the point they're on the baking sheet, cut and ready to bake; don't brush them with cream. Freeze, then remove from the sheet, and wrap airtight in a plastic bag. When you're ready to bake, remove however many you want to bake from the freezer, place on a baking sheet, brush with cream, and bake in a preheated 425°F oven for 35 to 40 minutes, until golden brown.\r\n\r\nMake mini-scones: Divide the dough in half, and roll each half into a 5\" round. Cut each round into 8 wedges. Bake in a preheated 425°F oven till golden brown, 18 to 20 minutes; or for about 25 minutes if frozen.",
        "ingredients": [
            "2 cup All-Purpose Flour (or Pastry Flour Blend)\r",
            "1 teaspoon salt\r",
            "1 tablespoon baking powder\r",
            "2 teaspoon sugar\r",
            "4 tablespoon butter, cold\r",
            "1 cup cheddar cheese, very coarsely grated or diced\r",
            "1\/3 cup fresh chives, snipped\r",
            "1\/2 pound bacon, cooked, cooled, and crumbled (about 1 cup)\r",
            "3\/4 cup heavy cream, or enough to make the dough cohesive\r",
            "2 tablespoon heavy cream"
        ],
        "tags": [
            "breakfast"
        ]
    },
    {
        "recipe_name": "Golden-crusted Brussels sprouts",
        "preptime": 900,
        "waittime": 0,
        "cooktime": 600,
        "servings": 4,
        "comments": "",
        "calories": 424,
        "fat": 24,
        "satfat": 4,
        "carbs": 40,
        "fiber": 16,
        "sugar": 12,
        "protein": 28,
        "instructions": "",
        "ingredients": [
            "24 small Brussels sprouts\r",
            "1 tbsp extra-virgin olive oil\r",
            "Salt\r",
            "Black pepper\r",
            "1\/3 cup Parmesan, grated"
        ],
        "tags": [
            "sides"
        ]
    },
    {
        "recipe_name": "Chocolate covered strawberry quick oatmeal",
        "preptime": 300,
        "waittime": 0,
        "cooktime": 120,
        "servings": 1,
        "comments": "",
        "calories": 270,
        "fat": 9,
        "satfat": 3,
        "carbs": 44,
        "fiber": 6,
        "sugar": 18,
        "protein": 7,
        "instructions": "Microwave water in 2-cup Silicone Prep Bowl on HIGH for 1-1\/2 to 2 minutes.   \r\n\r\nMeanwhile, add dry oats and chocolate morsels to Make & Take Snack Jar; stir to mix. \r\n\r\nCarefully pour in water; stir until blended.  \r\n\r\nPlace lid loosely on Jar; let stand 3 minutes.  \r\n\r\nStir before serving; top with strawberry. ",
        "ingredients": [
            "3\/4 cup water\r",
            "1\/2 cup quick oats\r",
            "2 tbsp semi-sweet chocolate morsels\r",
            "1\/2 cup fresh fruit, chopped"
        ],
        "tags": [
            "breakfast"
        ]
    },
    {
        "recipe_name": "Apple cheddar bacon egg muffins",
        "preptime": 900,
        "waittime": 0,
        "cooktime": 900,
        "servings": 6,
        "comments": "Can be frozen after baking",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Preheat the oven to 350°F (180°C). Spray 12 silicon muffin cups with oil, set out on a baking sheet.\r\n\r\nWhisk the eggs, milk, and salt in the Classic Batter Bowl until combined.\r\n\r\nAdd the cheese, apples, bacon bits, and seasoning to the batter bowl and stir to combine.\r\n\r\nTransfer the batter evenly into the muffin cups, about 1\/4 cup in each. Bake for 15–18 minutes, or until the eggs are set.\r\n\r\nRemove the pan from the oven. Cool for 5 minutes in the cups and carefully remove. Sprinkle with additional seasoning.",
        "ingredients": [
            "8 eggs\r",
            "1\/2 cup milk\r",
            "1\/4 tsp salt\r",
            "2 oz cheddar cheese, grated\r",
            "1\/2 Granny Smith apple, cored and diced small\r",
            "2 slices bacon, cooked and crumbled\r",
            "1 serving [French Toast Popcorn Seasoning](http:\/\/www.xanthir.com\/recipes\/showrecipe.php?id=id481)"
        ],
        "tags": [
            "breakfast"
        ]
    },
    {
        "recipe_name": "Almond latte overnight oats",
        "preptime": 600,
        "waittime": 0,
        "cooktime": 0,
        "servings": 1,
        "comments": "",
        "calories": 362,
        "fat": 11,
        "satfat": 2,
        "carbs": 56,
        "fiber": 10,
        "sugar": 23,
        "protein": 10,
        "instructions": "Place oats, almonds, seeds, brown sugar, and espresso powder in Make & Take Snack Jar; stir to mix. \r\n\r\nCarefully add almond milk and water; stir to blend.  \r\n\r\nTop with lid. \r\n\r\nPlace in refrigerator and let stand overnight. ",
        "ingredients": [
            "1\/2 cup old-fashioned or quick oats\r",
            "2 tbsp slivered almonds\r",
            "1 tbsp chia seeds\r",
            "1 tbsp brown sugar\r",
            "1\/2 tsp espresso powder\r",
            "1\/2 cup chocolate almond milk\r",
            "1\/3 cup water"
        ],
        "tags": [
            "breakfast"
        ]
    },
    {
        "recipe_name": "Smoky Seared Cod with Roasted Potatoes & Dates",
        "preptime": 900,
        "waittime": 0,
        "cooktime": 2100,
        "servings": 2,
        "comments": "",
        "calories": 1340,
        "fat": 62,
        "satfat": 18,
        "carbs": 138,
        "fiber": 16,
        "sugar": 36,
        "protein": 68,
        "instructions": "Preheat the oven to 450°F. Wash and dry the fresh produce. Cut the potatoes into 1\/4-inch-thick rounds. Peel and thinly slice the shallot. Peel and roughly chop the garlic. Roughly chop the dates. Quarter and deseed the lemon. Roughly chop the baby greens. Roughly chop the almonds.\r\n\r\nPlace the potatoes on a sheet pan. Drizzle with 2 teaspoons of olive oil and season with salt and pepper; toss to thoroughly coat. Arrange in a single, even layer and roast, flipping halfway through, 18 to 20 minutes, or until lightly browned and tender when pierced with a fork. Remove from the oven and carefully transfer to a large bowl. Set aside in a warm place.\r\n\r\nWhile the potatoes roast, in a small pot, combine the shallot, sugar, vinegar and ¼ cup of water; season with salt and pepper. Heat to boiling on high. Once boiling, cook, stirring occasionally, 1 to 2 minutes, or until the sugar has dissolved. Set aside to cool, stirring occasionally, for at least 10 minutes. Season with salt and pepper to taste.\r\n\r\nWhile the shallot cools, place the spice blend on a plate. Pat the cod fillets dry with paper towels; season with salt and pepper on both sides. Coat 1 side of each seasoned fillet in the spice blend (tapping off any excess). In a medium pan (nonstick, if you have one), heat 2 teaspoons of olive oil on medium-high until hot. Add the fillets, coated sides down, and cook 3 to 5 minutes on the first side, or until browned. Flip the fillets and cook 1 to 2 minutes, or until lightly browned.\r\n\r\nAdd the butter, garlic, dates and 1\/4 cup of water to the pan; season with salt and pepper. Cook, occasionally spooning the sauce over the fillets, 2 to 3 minutes, or until the cod is coated and cooked through. Turn off the heat and top with the juice of 2 lemon wedges. Season with salt and pepper to taste.\r\n\r\nReserving 2 tablespoons of the shallot pickling liquid, drain the pickled shallot. To the bowl of roasted potatoes, add the baby greens, pickled shallot, reserved pickling liquid, the juice of the remaining lemon wedges and a drizzle of olive oil. Gently toss to combine and season with salt and pepper to taste. Divide the finished vegetables between 2 dishes. Top with the finished cod fillets and sauce. Garnish with the almonds. Enjoy!",
        "ingredients": [
            "2 Cod Fillets\r",
            "2 Cloves Garlic\r",
            "2 Ounces Baby Greens\r",
            "1 Pink Lemon\r",
            "1 Pound Russet Potatoes\r",
            "2 Tablespoons Butter\r",
            "2 Tablespoons Red Wine Vinegar\r",
            "1 Shallot\r",
            "1 Tablespoon Sugar\r",
            "3 Tablespoons Roasted Almonds\r",
            "1\/2 Ounce Deglet Noor Dates\r",
            "1 1\/2 Tablespoons Smoky Cod Spice Blend (Rice Flour or potato starch & Smoked Paprika)"
        ],
        "tags": [
            "fish",
            "main"
        ]
    },
    {
        "recipe_name": "Restaurant Style Butter Chicken in Slow Cooker",
        "preptime": 900,
        "waittime": 0,
        "cooktime": 10800,
        "servings": 4,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "1. Marinade: In a food processor jar, add all the chicken marinade ingredients except yogurt, then process to make a fine puree. (if mixture is hard to blend, add 1 tbsp water)\r\n\r\n2. Transfer marinade to a wide bowl, and mix in yogurt. Then add cubed chicken meat and coat into the marinade. Set aside for 15­-20 minutes\r\n\r\n3. Infuse Flavors: In meantime, heat 2 tbsp butter in a wide pan. Saute onion in butter on medium heat until soft and fragrant (2-­3 minutes). Now, add remaining 1\/2 tsp garam masala and continue saute for 1 more minute.\r\n\r\n4. Transfer the marinated chicken with all marinade and remaining 1 tbsp butter and honey into the saute pan. Cook chicken in pan for 5 minutes on medium­-high heat or until curry looks darker color.\r\n\r\n5. Slow Cooker: Transfer everything in slow cooker with 1\/4 cup water (or chicken stock for more flavor). Cook on high for 1.25 hours Or on slow for 3-­4 hours.\r\n\r\n6. Before serving, after the cooker timer is up, add heavy cream and mix well. Taste and adjust salt. Leave on warm until ready to serve.\r\n",
        "ingredients": [
            "1\/4 Cup slivered almonds\r",
            "2 Tomatoes\r",
            "1 1\/2 tbsp Tomato Paste\r",
            "1 tsp garam masala\r",
            "1 tsp Chili Powder (or 1\/2 tsp cayenne (add more if like spicy))\r",
            "1 tsp Cumin Powder\r",
            "1 2-inch piece Ginger\r",
            "3 clove Garlic, peeled\r",
            "1\/2 tsp Salt\r",
            "1\/3 Cup non-fat Greek yogurt\r",
            "<hr>\r",
            "1 1\/2 lb Chicken (boneless chicken thigh), cut into 2-­3 inch cubes\r",
            "1\/2 tsp garam masala\r",
            "2 tbsp Cilantro, chopped, for garnish\r",
            "1 tbsp Honey\r",
            "3 tbsp Heavy Cream (adjust per taste; I add up to 1\/3 cup based on tartness of tomatoes)\r",
            "3 tbsp Unsalted Butter\r",
            "1\/2 Cup Red Onion, sliced to thin half­moon slices"
        ],
        "tags": [
            "indian",
            "main",
            "slow_cooker",
            "untried"
        ]
    },
    {
        "recipe_name": "Overnight Cinnamon Rolls",
        "preptime": 1200,
        "waittime": 68400,
        "cooktime": 3600,
        "servings": 8,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "FOR THE DOUGH\r\n\r\n1. Combine the egg yolks, whole egg, sugar, butter and buttermilk in the bowl of a stand mixer and whisk at medium speed.\r\n2. As the mixture comes together add 10 ounces of the flour, along with the yeast and salt and continue whisking until combined.\r\n3. Remove the whisk attachment and replace it with a dough hook. Add another 4 ounces of the remaining flour and knead on low speed for 5 minutes. At this point the dough should feel soft and moist but not sticky. If it is sticky, add a bit more flour (one ounce at a time). Knead on low for another 5 minutes or until the dough clears the sides of the bowl.\r\n4. Turn the dough out onto a lightly floured work surface; and form dough into a smooth ball. Transfer to a large bowl that has been lightly lubed with the vegetable oil. Rotate the bowl so that the dough ball is evenly covered. Cover with a clean kitchen towel and set aside until the dough doubles in volume, about 3 hours. (Exact times will vary depending on the temperature of the room and the temperature of the ingredients.)\r\n\r\nFOR THE FILLING\r\n\r\n1. Combine the brown sugar, cinnamon and salt in a medium bowl and set aside.\r\n\r\nTO ASSEMBLE\r\n\r\n1. Butter a 9 by 13-inch glass baking dish with the cold butter.\r\n2. Turn the dough out onto a lightly floured work surface and gently shape into a rectangle with the long side nearest you. Then use a rolling pin to shape into 18 by 12-inch rectangle.\r\n3. Brush the dough with the the melted butter, leaving a 1-inch border along the top edge.\r\n4. Sprinkle the brown sugar mixture over the dough, also avoiding the top border.\r\n5. Gently press the filling into the dough. (If you tend to have hot hands, you may want to cover the filling with a layer of plastic wrap first.)\r\n6. Beginning with the long edge nearest you, roll the dough away from you into a tight cylinder. Firmly pinch the seam to seal and roll the cylinder seam side down. Very gently squeeze the cylinder to create even thickness.\r\n8. Using a serrated knife, gently cut the cylinder into 2-inch rolls; yielding 8 pieces.\r\n9. Arrange rolls cut side down in the baking dish; cover tightly with plastic wrap and store in the refrigerator overnight, or up to 16 hours.\r\n\r\nTO BAKE\r\n\r\n1. Heat the oven to 200 degrees F.\r\n2. When the oven has reached 200 degrees F, turn it off and place the rolls in the turned-off oven. Let the rolls rise until they look slightly puffy, about 30 minutes.\r\n3. Without taking the rolls out of the oven, increase the oven temperature to 350 degrees F and let the rolls continue to bake for 25 to 30 minutes, or until the internal temperature reaches 190 degrees F. Remove the rolls and let cool while you make the icing.\r\n\r\nFOR THE ICING\r\n\r\n1. Whisk the cream cheese in the bowl of a stand mixer until creamy. Add the milk and whisk until combined. Sift in the powdered sugar, and whisk until smooth. Spread over the rolls and serve immediately.\r\n\r\nNotes\r\n\r\nIn case there are leftovers, arrange them on a plate and cover thoroughly with plastic wrap for up to 3 days. To reheat, move to a small plate (I usually use a paper plate) and microwave on high for 30 seconds. Two rolls can be reheated this way, three may require a few seconds more. Four will ... let's face it, you're not going to have that many left over and you know it.\r\n\r\nTo freeze: Individually wrap the rolls in plastic wrap and place them in a zip-top freezer-safe bag. When ready to eat, uncover and defrost on the counter for an hour. Then microwave for 30 seconds.",
        "ingredients": [
            "4 large egg yolks, room temperature\r",
            "1 large whole egg, room temperature\r",
            "2 ounce sugar, approximately 1\/4 cup\r",
            "6 tablespoon unsalted butter, melted\r",
            "1 teaspoon cold butter for lubricating baking dish\r",
            "3\/4 cup buttermilk, room temperature\r",
            "15 ounce all-purpose flour divided into 10 ounces, 4 ounces and 1 ounce batches\r",
            "1 package rapid rise yeast, approximately 1\/4 ounce\r",
            "1 1\/4 teaspoon kosher salt\r",
            "<hr>\r",
            "8 ounce light brown sugar\r",
            "1 tablespoon cinnamon, ground\r",
            "Pinch kosher salt\r",
            "1 1\/2 tablespoon unsalted butter, melted\r",
            "<hr>\r",
            "2 1\/2 ounce cream cheese, softened\r",
            "3 tablespoon milk\r",
            "5 1\/2 ounce confectioners' sugar"
        ],
        "tags": [
            "breakfast"
        ]
    },
    {
        "recipe_name": "Hot buttered rum",
        "preptime": 300,
        "waittime": 0,
        "cooktime": 0,
        "servings": 12,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "In a bowl, cream together the butter, sugar, cinnamon, nutmeg, cloves, and salt. Refrigerate until almost firm. Spoon about 2 tablespoons of the butter mixture into 12 small mugs. Pour about 3 ounces of rum into each mug (filling about halfway). Top with boiling water (to fill the remaining half), stir well, and serve immediately.",
        "ingredients": [
            "1 stick unsalted butter, softened\r",
            "2 cup light brown sugar\r",
            "1 teaspoon ground cinnamon\r",
            "1\/2 teaspoon grated nutmeg\r",
            "1 Pinch ground cloves\r",
            "1 Pinch salt\r",
            "1 Bottle dark rum\r",
            "Boiling water"
        ],
        "tags": [
            "drink"
        ]
    },
    {
        "recipe_name": "Salt-baked walnut brioche scones",
        "preptime": 900,
        "waittime": 3600,
        "cooktime": 1080,
        "servings": 8,
        "comments": "",
        "calories": 2968,
        "fat": 200,
        "satfat": 72,
        "carbs": 248,
        "fiber": 16,
        "sugar": 104,
        "protein": 56,
        "instructions": "Place the tempered salt block on a heavy baking sheet and place on the middle rack of the oven. Turn on the oven to 350F, and heat the block for 1 hour.\r\n\r\nIn the work bowl of a food processor equipped with a steel blade, combine the flour, sugar, baking powder and salt. Process in short pulses to combine. Add the butter and process in 2 to 3 pulses until it is dispersed evenly.Add the egg yolks and cream and process until the mixture becomes a cohesive dough, about 40 seconds. Add the walnuts and process in pulses until combined, but not so much that the walnuts become finely ground.\r\n\r\nTurn the dough out onto a clean work surface and pat into a 9-inch circle about 3\/4-inch thick. Cut into 8 wedges. Arrange the cut scones on the hot salt block and bake until puffed and browned, about 18 minutes.\r\n\r\nRemove from the salt block with a spatula and let cool on a rack for 5 minutes before serving.",
        "ingredients": [
            "1 1\/2 cup all-purpose flour\r",
            "1\/2 cup sugar\r",
            "1 1\/2 tsp baking powder\r",
            "1 pinch fine salt (Himalayan salt is preferred)\r",
            "6 tbsp unsalted butter, softened, cut into 12 pieces\r",
            "6 extra-large egg yolks\r",
            "1\/4 cup heavy cream\r",
            "1 cup walnuts, chopped"
        ],
        "tags": [
            "dessert",
            "breakfast"
        ]
    },
    {
        "recipe_name": "Chocolate chip pumpkin bread",
        "preptime": 0,
        "waittime": 1800,
        "cooktime": 3600,
        "servings": 2,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Preheat oven to 350 degrees\r\n\r\nIn a large bowl combine the flour, sugar, baking soda, baking powder and salt. Set aside.\r\n\r\nIn a mixer combine the pumpkin, oil, eggs, water and spices on medium speed. Slowly add the dry ingredients and mix on low until everything is just combined. Lastly, add the chocolate chips and fold in with a spatula.\r\n\r\nTransfer batter to 2 oiled loaf pans. Top with extra chocolate chips if desired and bake for about 55-60 minutes, until a knife is inserted in the middle and comes out clean. Remove the loaf pans from the oven and let the Chocolate Chip Pumpkin Bread cool for at least 30 minutes before removing and slicing.",
        "ingredients": [
            "3 cup all purpose flour\r",
            "3 cup white sugar\r",
            "2 teaspoon baking soda\r",
            "1\/2 teaspoon baking powder\r",
            "1 teaspoon kosher salt\r",
            "2 cup canned pumpkin\r",
            "1 cup vegetable oil\r",
            "4 eggs\r",
            "2\/3 cup water\r",
            "1 teaspoon ground cloves\r",
            "1 teaspoon allspice\r",
            "1\/2 teaspoon pumpkin pie spice\r",
            "1\/2 bag semi-sweet chocolate chips"
        ],
        "tags": [
            "dessert",
            "untried"
        ]
    },
    {
        "recipe_name": "Spider web brownies",
        "preptime": 1200,
        "waittime": 0,
        "cooktime": 1800,
        "servings": 24,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Prepare our Fudge Brownie recipe, and spread the batter in a greased 9\" x 13\" pan, or two 8\" round pans. Preheat the oven to 350°F.\r\n\r\n1. Combine the cream cheese, sugar and flour in a small bowl, and mix until smooth. Add the egg yolk and flavoring (if using), mixing until smooth once again. Transfer the mixture to a disposable pastry bag, and cut just the very tip off the end, as shown.\r\n\r\n2. Place a small pool of the mixture in the center of the brownie batter. Draw circles around this pool, about 1 inch apart, moving out from the center each time.\r\n\r\n3. Once the circles are drawn, take a table knife, wet the tip, and draw it back and forth through the circles.\r\n\r\n4. The knife will draw the cream cheese filling into arcs, as you see here. Once you've gone all the way around the circles, take up your pastry bag again.\r\n\r\n5. Use the remaining filling to trace the path where the knife travelled, to create the spokes of the web.\r\n\r\n6. Bake the brownies for 30 minutes, until the brownies just barely pull away from the edge of the pan. The center will rise while baking, but will sink back level once the brownies are cool. Remove them from the oven and cool before cutting.\r\n\r\nhttp:\/\/www.kingarthurflour.com\/recipes\/spiderweb-brownies-recipe",
        "ingredients": [
            "24 serving [fudge brownies](http:\/\/www.xanthir.com\/recipes\/showrecipe.php?id=id350)",
            "4 ounce cream cheese, at room temperature\r",
            "2 tablespoon sugar\r",
            "1 tablespoon King Arthur Unbleached All-Purpose Flour\r",
            "1 large egg yolk\r",
            "1\/2 teaspoon mint flavoring (optional)"
        ],
        "tags": [
            "dessert",
            "halloween"
        ]
    },
    {
        "recipe_name": "Fudge brownies",
        "preptime": 900,
        "waittime": 0,
        "cooktime": 1800,
        "servings": 24,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "1) Preheat the oven to 350°F. Lightly grease a 9\" x 13\" pan\r\n\r\n2) Crack the 4 eggs into a bowl, and beat them with the cocoa, salt, baking powder, espresso powder, and vanilla till smooth.\r\n\r\n3) In a medium-sized microwave-safe bowl, or in a saucepan set over low heat, melt the butter, then add the sugar and stir to combine. Or simply combine the butter and sugar, and heat, stirring, until the butter is melted. Continue to heat (or microwave) briefly, just until the mixture is hot (about 110°F to 120°F), but not bubbling; it'll become shiny looking as you stir it. Heating the mixture to this point will dissolve more of the sugar, which will yield a shiny top crust on your brownies.\r\n\r\n4) Add the hot butter\/sugar mixture to the egg\/cocoa mixture, stirring until smooth.\r\n\r\n5) Add the flour and chips, again stirring until smooth. Note: If you want the chips to remain intact in the baked brownies, rather than melting in, let the batter cool in the bowl for about 20 minutes before stirring in the chips.\r\n\r\n6) Spoon the batter into a lightly greased 9\" x 13\" pan.\r\n\r\n7) Bake the brownies for about 30 minutes, until a cake tester inserted into the center comes out clean, or with just a few moist crumbs clinging to it. The brownies should feel set on the edges, and the center should look very moist, but not uncooked. Remove them from the oven and cool on a rack before cutting and serving.",
        "ingredients": [
            "4 eggs\r",
            "1 1\/4 cup Double-Dutch Dark Cocoa or Dutch-process cocoa\r",
            "1 teaspoon salt\r",
            "1 teaspoon baking powder\r",
            "1 teaspoon espresso powder\r",
            "1 tablespoon vanilla extract\r",
            "1 cup unsalted butter\r",
            "2 1\/4 cup sugar\r",
            "1 1\/2 cup All-Purpose Flour\r",
            "2 cup chocolate chips"
        ],
        "tags": [
            "dessert"
        ]
    },
    {
        "recipe_name": "Hot Nutty Irishman",
        "preptime": 300,
        "waittime": 0,
        "cooktime": 0,
        "servings": 1,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Place Irish cream, Frangelico, and Kahlua in a coffee mug; pour over coffee. Top with whipped cream and sanding sugar, if desired.",
        "ingredients": [
            "1 ounce Irish cream liqueur\r",
            "1 ounce Frangelico\r",
            "1 ounce Kahlua\r",
            "5 ounce hot coffee\r",
            "Whipped cream, for garnish\r",
            "Green sanding sugar, for garnish (optional)"
        ],
        "tags": [
            "drink",
            "untried"
        ]
    },
    {
        "recipe_name": "Black bean and brown rice cakes",
        "preptime": 1200,
        "waittime": 0,
        "cooktime": 3300,
        "servings": 4,
        "comments": "",
        "calories": 1252,
        "fat": 20,
        "satfat": 4,
        "carbs": 196,
        "fiber": 52,
        "sugar": 16,
        "protein": 76,
        "instructions": "1. Preheat oven to 450 degrees. In a food processor, pulse half the beans with scallions, jalapeno, and cumin until a chunky paste forms. In a large bowl, combine bean puree with rice and remaining beans; season with salt and pepper. Divide mixture into eight 3-inch-wide patties. (To freeze, wrap individually in plastic and freeze up to 2 weeks; thaw before cooking.)\r\n\r\n2. Brush a rimmed baking sheet with oil; place in oven to heat, 5 minutes. Carefully place patties on hot sheet; bake until bottoms are golden brown, 10 to 12 minutes, rotating sheet halfway through. Let rest on sheet 5 minutes before removing.\r\n\r\n3. Meanwhile, in a small bowl, combine yogurt, cilantro, and lime juice; season with salt and pepper. Serve patties topped with yogurt sauce and cilantro leaves.",
        "ingredients": [
            "2 can black beans, rinsed and drained\r",
            "2 green onions, coarsely chopped\r",
            "1 jalapeno, seeded and chopped\r",
            "1\/4 teaspoon ground cumin\r",
            "3\/4 cup cooked brown rice\r",
            "Coarse salt and ground pepper\r",
            "1 tablespoon extra-virgin olive oil\r",
            "1\/2 cup plain low-fat yogurt\r",
            "1 tablespoon fresh cilantro, finely chopped , plus leaves for serving\r",
            "1 tablespoon fresh lime juice"
        ],
        "tags": [
            "vegetarian",
            "main"
        ]
    },
    {
        "recipe_name": "Italian ice",
        "preptime": 0,
        "waittime": 9000,
        "cooktime": 0,
        "servings": 4,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "1. Blend the fruit, sugar, honey, and lemon juice with ice in a food processor or blender until chunky. Add another 1 cup ice and blend until completely smooth.\r\n\r\n2. Pour the mixture into a shallow baking dish and freeze 30 minutes. Scrape the ice with a fork until slushy then freeze until firm, about 2 more hours. Scoop into paper cups for serving.",
        "ingredients": [
            "3 cup halved strawberries or chopped pineapple\r",
            "2 tbsp sugar\r",
            "2 tbsp honey\r",
            "1 tbsp fresh lemon juice\r",
            "3 cup ice"
        ],
        "tags": [
            "dessert",
            "untried"
        ]
    },
    {
        "recipe_name": "Mediterranean Patio Pizza",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 6,
        "comments": "",
        "calories": 2100,
        "fat": 114,
        "satfat": 0,
        "carbs": 0,
        "fiber": 30,
        "sugar": 0,
        "protein": 0,
        "instructions": "Preheat oven to 375°F. Roll out dough.  Lightly spray dough with olive oil, then add garlic.  Bake 14-16 minutes or until golden brown; cool completely. \r\n\r\nFor cheese spread, finely chop enough artichoke hearts to make 1\/4 cup. Combine with cream cheese, half of the feta cheese and oregano in bowl; mix well. Spread mixture evenly over crust. \r\n\r\nFor toppers, quarter remaining artichoke hearts. Arrange them and all other vegetables over cream cheese mixture. Sprinkle with remaining feta cheese and pine nuts.  Drizzle with salad dressing just before serving.  ",
        "ingredients": [
            "1 lb refrigerated pizza dough\r",
            "Olive oil\r",
            "1 garlic clove, pressed\r",
            "<hr>\r",
            "1 14oz can artichoke hearts in water, drained, divided\r",
            "4 ounce cream cheese, softened\r",
            "4 ounce feta cheese, crumbled, divided\r",
            "1\/2 teaspoon dried oregano\r",
            "<hr>\r",
            "2 plum tomatoes, seeded and chopped\r",
            "1\/3 cup black olives, pitted and sliced\r",
            "1\/3 cup cucumber, sliced and quartered\r",
            "1\/4 small red onion, sliced into thin wedges\r",
            "2 tablespoon pine nuts, toasted (optional)\r",
            "2 tbsp olive oil\r",
            "1 tbsp red wine vinegar\r",
            "1\/2 tsp dijon mustard \r",
            "salt and pepper"
        ],
        "tags": [
            "pizza",
            "main",
            "vegetarian"
        ]
    },
    {
        "recipe_name": "Pot Roast Carbonnade",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 4,
        "comments": "I like to serve this over mashed potatoes.",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Preheat the oven to 325 degrees F.\r\n\r\nIn a large Dutch oven over medium-low heat, add the bacon and cook until it renders its fat and almost becomes crispy. Remove it with a slotted spoon to a plate. Add the onions, season with salt and pepper, to taste, and cook over low heat until they are deep in color and caramelized, about 30 minutes.\r\n\r\nRemove the onions to a plate, leaving as much fat in the pot as possible. Add the vegetable oil and mix it with the bacon fat. Raise the heat to high. Season the beef liberally with salt and pepper and sear, in batches, until nicely browned on both sides.\r\n\r\nOnce the meat is browned, add the first batch of meat back to the pan along with the onions, carrots and bacon. Sprinkle in the flour and stir. Cook for 1 minute before deglazing the pan with the beer. Add the remaining ingredients and bring the mixture to a simmer. Cover the pot and put it in the oven to braise until the beef is tender, about 2 hours. Remove the pot from the oven and transfer the pot roast to a serving dish.",
        "ingredients": [
            "1\/2 pound bacon, cut into large lardons\r",
            "2 medium onions, sliced\r",
            "Kosher salt and freshly ground black pepper\r",
            "1 tablespoon vegetable oil\r",
            "1 1\/2 pound beef chuck, cut into large cubes\r",
            "5 carrots, peeled and cut into large chunks\r",
            "1 tablespoon all-purpose flour\r",
            "12 ounce beer (dark or light)\r",
            "6 prunes\r",
            "1 tablespoon dried thyme\r",
            "1 cup beef stock"
        ],
        "tags": [
            "beef",
            "main"
        ]
    },
    {
        "recipe_name": "Old Fashion Vegetable Soup",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 6,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "In a large soup pot, brown ground beef and onion, drain off fat.  Add remaining ingredients EXCEPT for last 3 items (canned vegetables).  Simmer on low heat until vegetables are tender, about an hour.  Add canned vegetables and simmer 5 minutes.  Remove bay leaf and serve.",
        "ingredients": [
            "1 pound ground beef\r",
            "1 cup onion, chopped\r",
            "1 cup potatoes, diced\r",
            "1 cup carrots, sliced\r",
            "1 cup celery, diced\r",
            "2 16oz can diced tomatoes in juice (or substitute 2 small cans of tomato sauce)\r",
            "4 cup water\r",
            "1\/4 tsp dried basil, crushed\r",
            "1\/4 tsp dried thyme\r",
            "1 bay leaf\r",
            "1\/2 tsp salt\r",
            "1\/4 tsp pepper\r",
            "1\/2 tsp garlic powder\r",
            "2 tablespoon beef bouillon\r",
            "1 16oz can corn\r",
            "1 16oz can green beans\r",
            "1 16oz can green peas"
        ],
        "tags": [
            "soup",
            "beef",
            "family_recipes",
            "main"
        ]
    },
    {
        "recipe_name": "Godiva Dark Chocolate Cheesecake",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 10,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "In a food processor with a blade attachment, cream the cheese until smooth and then add in sugar. Pulse a couple times to incorporate sugar and cocoa powder. Add in eggs and yolks pulsing a couple times again and scrape down to ensure all is smooth and uniform. With machine running, pour in melted Godiva Chocolate in a steady stream until all in, and finish by pulsing in the crème fraiche. Pour batter into a 10\" x 10\" baking pan and bake at 325 for 30, minutes or until custard is set and a toothpick inserted in center can be removed cleanly. The top may caramelize or brown slightly, which is not an issue. Once set, remove from oven and allow cheesecake to cool completely. Wrap the pan with plastic and reserve in cooler to set and chill completely.\r\n\r\nOnce the cheesecake is cold and firm, remove it from the pan and place in a mixer bowl with a paddle attachment. Beat the cake for a few moments to soften and smooth out the custard. Place smoothed custard into a piping bag with a plain tip and pipe into the bottom of a plastic lined half cylinder mold. Tap the mold to ensure the custard is solid and then flatten out to top. Freeze the mold to harden the custard for unmolding. Once the cake can be unmolded, remove from the pan and cut into 1½\" sections. Brush some tempered Godiva Dark Chocolate onto a strip of acetate and, while it is still fluid, smooth over the top of the molded cheesecake. Once the chocolate has cooled and completely crystallized, remove the acetate, revealing a shiny and textured chocolate finish.",
        "ingredients": [
            "2 1\/2 cup cream cheese, room temperature\r",
            "1\/2 cup sugar\r",
            "1 3\/4 tablespoon cocoa powder\r",
            "5 tablespoon Godiva 85% Dark Chocolate Callets\r",
            "2 eggs\r",
            "2 egg yolks\r",
            "1 3\/4 tablespoon crème faiche"
        ],
        "tags": [
            "cheesecake",
            "dessert",
            "pie",
            "chocolate",
            "untried"
        ]
    },
    {
        "recipe_name": "The Ultimate Green Smoothie",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 2,
        "comments": "",
        "calories": 427,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "To prepare, just throw everything in a blender and give it a whirl!",
        "ingredients": [
            "1 apple\r",
            "1 banana\r",
            "3 leaves kale, stemmed\r",
            "1\/2 cup spinach\r",
            "1 scoop protein powder\r",
            "1 tbsp hemp seeds\r",
            "1 tsp maple syrup or agave\r",
            "1 lime, juiced\r",
            "2 cup water"
        ],
        "tags": [
            "smoothie",
            "FUF",
            "breakfast"
        ]
    },
    {
        "recipe_name": "Tropical Nut Smoothie",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 2,
        "comments": "",
        "calories": 628,
        "fat": 18,
        "satfat": 14,
        "carbs": 81,
        "fiber": 7,
        "sugar": 61,
        "protein": 42,
        "instructions": "Combine all ingredients in blender. Blend until smooth.",
        "ingredients": [
            "1 cup pineapple chunks\r",
            "1 banana\r",
            "1\/4 cup coconut milk\r",
            "2 tbsp cocoa powder\r",
            "1 scoop protein powder (optional)\r",
            "2 cup skim milk"
        ],
        "tags": [
            "smoothie",
            "FUF",
            "breakfast"
        ]
    },
    {
        "recipe_name": "Guacamole",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 8,
        "comments": "",
        "calories": 1552,
        "fat": 120,
        "satfat": 16,
        "carbs": 72,
        "fiber": 64,
        "sugar": 16,
        "protein": 24,
        "instructions": "1. Place all ingredients in a bowl with a flat bottom and mash it with a potato masher.  Alternatively, you can mix everything briefly in a food processor.\r\n2. Stir well and keep refrigerated. This dish will brown on the areas exposed to air within a few hours, so serve it shortly after making it or just stir again before serving.",
        "ingredients": [
            "4 ripe avocados\r",
            "2 roma tomates, diced fine\r",
            "1\/2 red onion, minced\r",
            "1\/2 handful cilantro, minced\r",
            "2 clove garlic, minced\r",
            "1 lime, juiced\r",
            "Pinch of sea salt\r",
            "1 jalapeno, seeded and minced fine (optional)"
        ],
        "tags": [
            "dip",
            "appetizer",
            "mexican",
            "FUF",
            "sides"
        ]
    },
    {
        "name": "The Ironman Smoothie",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 2,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "In a blender, blend all ingredients until smooth",
        "ingredients": [
            "10 strawberries\r",
            "10 raspberries\r",
            "1 slice of watermelon\r",
            "1 handful parsley\r",
            "1\/2 cup water\r",
            "3 ice cubes, if desired\r",
            "1\/2 lemon, juiced"
        ],
        "tags": [
            "smoothie",
            "FUF",
            "breakfast"
        ]
    }
]
